app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "movies" SET "released_on" = ?, "updated_at" = ? WHERE "movies"."id" = 8  [["released_on", Sun, 04 Jul 2010], ["updated_at", Sat, 07 Sep 2013 22:24:55 UTC +00:00]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save